Repository: lichtbaer/pbd-toolkit
Catalog: locales/*/LC_MESSAGES/*.po
Languages: de

source: HBDI PII Toolkit
de: HBDI-pbD-Toolkit

source: Root directory under which to recursively search for PII
de: Stammpfad, der mit allen Unterverzeichnissen auf pbD überprüft werden soll

source: Optional parameter; string which to include in the file name of all output files
de: optionaler Parameter, die hier angegebene Zeichenkette wird zur Benennung der erzeugten Output-Dateien verwendet

source: Optional parameter; relative path to a text file containing one string per line. These strings will be matched against potential findings to exclude them from the output.
de: Relativer Pfad zu einer Textdatei, die pro Zeile eine Zeichenkette enthält, die als Ausschluss potentieller Treffer verwendet wird

source: Optional parameter; stop analysis after N files
de: Analyse nach N Dateien abbrechen

source: Use regular expressions for analysis
de: Falls gesetzt, so werden reguläre Ausdrücke zur Analyse genutzt

source: Use AI-based Named Entity Recognition for analysis
de: Falls gesetzt, so werden KI-gestützte Named Entity Recognition-Funktionalitäten zur Analyse genutzt

source: --path parameter cannot be empty
de: --path-Parameter kann nicht leer sein

source: Regex- and/or NER-based analysis must be turned on.
de: RegEx- und/oder NER-Analyse müssen aktiviert sein.

source: Analysis
de: Analyse

source: Analysis started at {}
de: Analyse gestartet um {}

source: Regex-based search is active.
de: RegEx-Suche ist aktiv.

source: Regex-based search is *not* active.
de: RegEx-Suche ist *nicht* aktiv.

source: AI-based search is active.
de: KI-gestützte NER ist aktiv.

source: AI-based search is *not* active.
de: KI-gestützte NER ist *nicht* aktiv.

source: Statistics
de: Statistiken

source: The following file extensions have been found:
de: Folgende Dateiendungen wurden gefunden:

source: TOTAL: {} files. QUALIFIED: {} files (supported file extension)
de: GESAMT: {} Dateien. QUALIFIZIERT: {} Dateien (unterstützte Dateiendungen)

source: Findings
de: Funde

source: --> see *_findings.csv
de: --> siehe *_findings.csv

source: Errors
de: Fehler

source: Analysis finished at {}
de: Analyse abgeschlossen um {}

source: Performance of analysis: {} analyzed files per second
de: Analyse-Performance: {} analysierte Dateien pro Sekunde

source: Regex: Pension Insurance Fond ID
de: RegEx: Rentenversicherungsnummer

source: Regex: Email address
de: RegEx: E-Mail-Adresse

source: Regex: IPv4 address
de: RegEx: IPv4-Adresse

source: Regex: Signal words
de: RegEx: spezielle Wörter

source: Regex: private pgp key
de: RegEx: Privater PGP-Schlüssel

source: AI-NER: Person
de: KI-NER: Person

source: AI-NER: Location
de: KI-NER: Ort

source: AI-NER: Health Data (experimental)
de: KI-NER: Gesundheitsdaten (experimentell)

source: AI-NER: Passwords (experimental)
de: KI-NER: Passwörter (experimentell)
